astetyn/ArduinoCore-samd/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

# Inspirium v3 Board
# --------------------------------------
inspirium.name=Inspirium
inspirium.vid.0=0x2341
inspirium.pid.0=0x804d
inspirium.vid.1=0x2341
inspirium.pid.1=0x004d
inspirium.vid.2=0x2341
inspirium.pid.2=0x824d
inspirium.vid.3=0x2341
inspirium.pid.3=0x024d

inspirium.upload.tool=bossac
inspirium.upload.protocol=sam-ba
inspirium.upload.maximum_size=262144
inspirium.upload.maximum_data_size=32768
inspirium.upload.use_1200bps_touch=true
inspirium.upload.wait_for_upload_port=true
inspirium.upload.native_usb=true
inspirium.build.mcu=cortex-m0plus
inspirium.build.f_cpu=48000000L
inspirium.build.usb_product="Inspirium"
inspirium.build.usb_manufacturer="astetyne labs"
inspirium.build.board=INSPIRIUM
inspirium.build.core=arduino
inspirium.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
inspirium.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
inspirium.build.openocdscript=openocd_scripts/arduino_zero.cfg
inspirium.build.variant=inspirium
inspirium.build.variant_system_lib=
inspirium.build.vid=0x2341
inspirium.build.pid=0x804d
inspirium.bootloader.tool=openocd
inspirium.bootloader.file=zero/samd21_sam_ba.bin